Tekla Open API Reference for Tekla Structures 2025
BentPlateGeometrySolver.AddLeg Method (ConnectiveGeometry, LineSegment, Contour, LineSegment, Double, Double)
 Joins a polygon section to this ConnectiveGeometry, using the specified connection points and radius and aperture for the conical connection.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ConnectiveGeometry AddLeg(
	ConnectiveGeometry geometry,
	LineSegment segment1,
	Contour polygon,
	LineSegment segment2,
	double largestRadius,
	double halfAperture
)
Public Function AddLeg (
	geometry As ConnectiveGeometry,
	segment1 As LineSegment,
	polygon As Contour,
	segment2 As LineSegment,
	largestRadius As Double,
	halfAperture As Double
) As ConnectiveGeometry
Parameters
geometry
Type: Tekla.Structures.Model.ConnectiveGeometry
ConnectiveGeometry used to create a connection with.
segment1
Type: Tekla.Structures.Geometry3d.LineSegment
The two connection points on this instance geometry.
polygon
Type: Tekla.Structures.Model.Contour
the polygonal contour to add to this geometry
segment2
Type: Tekla.Structures.Geometry3d.LineSegment
The two connection points on polygon geometry.
largestRadius
Type: System.Double
The specified largest radius for the connecting conical section.
halfAperture
Type: System.Double
The angle between the cone generatrix and any of its generator lines.
Return Value
Type: ConnectiveGeometry
Modified ConnectiveGeometry if command succeeded or geometry otherwise.
Exceptions
Exception | Condition
ConnectiveGeometryException | Thrown if could not create ConnectiveGeometry instance.
ArgumentException | Thrown when geometry is a stand-alone bend geometry, meaning that the first GeometrySection is a BendSurfaceNode.
See Also
Reference
BentPlateGeometrySolver Class
AddLeg Overload
Tekla.Structures.Model Namespace